# config.py

# Hyperparameters
class Config:
    MAX_LEN = 128
    BATCH_SIZE = 32
    LEARNING_RATE = 2e-5
    NUM_EPOCHS = 5
    WARMUP_RATIO = 0.1
    WEIGHT_DECAY = 0.01
    EARLY_STOPPING_PATIENCE = 3
    VALIDATION_SPLIT = 0.1

# Label
class Label:
    labels = {
        "주식/투자": ["주식", "투자", "수익", "펀드", "매매", "매도", "상장", "급등", "추천주", "정보제공"],
        "도박": ["카지노", "베팅", "스포츠토토", "슬롯", "홀덤", "경마", "바카라", "파워볼", "맞고", "바둑이"],
        "대출": ["대출", "저금리", "금리", "즉시", "원금보장", "신용", "지원금", "담보", "채무", "대부업", "금융"],
        "통신가입": ["통신사", "요금제", "유심", "개통", "휴대폰", "데이터", "5G", "LTE"],  # 불필요한 키워드 제거
        "쇼핑/할인 광고": ["광고", "홍보", "프로모션", "혜택", "이벤트", "쿠폰", "포인트", "첫구매", "선착순", "특가", "세일", "쇼핑몰", "구매", "무료배송", "바로가기", "회원전용", "할인코드"],  # 기존 "광고"를 쇼핑 광고로 특화
        "건강/다이어트": ["다이어트", "체중", "감량", "요요", "해독", "디톡스", "지방", "복부", "허벅지", 
                     "영양제", "세포전환", "한방", "한의사", "건강", "면역력", "탄수화물", "단백질", "운동"],  # 건강 제품, 다이어트 관련 메시지 필터링
        "불법사이트": ["웹발신", "bit.ly", "링크", "해외발신", "국제발신", "도메인", "사이트", ".com", ".net"],
        "스미싱/피싱": ["인증", "비밀번호", "OTP", "해킹", "계좌", "보안", "결제", "사기", "보이스피싱", "개인정보"],
        "성인 컨텐츠": ["AV", "성인", "야동", "19금", "일본야동", "성인용품", "몸캠", "화상채팅"]
    }
